app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    render json: Todo.all #.where(user_id: current_user.id)